{
  "python": "Python is your strength. Highlight unique projects or certifications using Python.",
  "django": "Django is a great backend framework. Include web apps or APIs you built using it.",
  "flask": "Flask is lightweight and flexible. Add small projects or REST APIs made with Flask.",
  "sql": "SQL is essential for managing databases. Include projects or coursework involving SQL.",
  "apis": "APIs connect systems. Mention when you designed or consumed REST APIs.",
  "java": "Showcase your Java projects, especially with Spring Boot or backend systems.",
  "spring boot": "Spring Boot simplifies backend development. Include any microservice projects.",
  "hibernate": "Hibernate helps manage databases efficiently. Add experience using it in Java apps.",
  "microservices": "Microservices architecture is valuable. Highlight modular projects using this approach.",
  "pandas": "Pandas is powerful for data manipulation. Mention data-cleaning or analytics work.",
  "numpy": "NumPy shows analytical thinking. Add numerical computing or ML preprocessing tasks.",
  "machine learning": "Machine Learning is in high demand. Highlight Kaggle work or academic projects.",
  "deep learning": "Deep Learning is a hot skill. Add work with TensorFlow or PyTorch.",
  "javascript": "JavaScript powers the web. Highlight dynamic websites or frontend logic you built.",
  "react": "React shows modern web skills. Include interactive UI projects.",
  "node.js": "Node.js is great for backends. Mention your API or real-time apps built with it.",
  "mongodb": "MongoDB suits modern apps. Add examples of NoSQL database integration.",
  "express": "Express supports Node.js APIs. Mention server-side projects using it.",
  "mern": "MERN stack shows full-stack web skills. Add any portfolio or group project using it.",
  "html": "HTML is the web’s backbone. Add clean, semantic markup experience.",
  "css": "CSS shows design sense. Mention responsive design or frameworks like Bootstrap.",
  "ui/ux": "UI/UX experience is valuable. Showcase designs or user-centered projects.",
  "bootstrap": "Bootstrap helps with responsive design. Mention modern layouts you created using it.",
  "excel": "Excel is core for data analysis. Mention data cleaning or dashboards.",
  "power bi": "Power BI helps with data storytelling. Add visualization dashboards you built.",
  "data visualization": "Data visualization makes insights clear. Highlight charts or storytelling projects.",
  "statistics": "Statistics is the base of data science. Add academic work or analysis-based projects.",
  "tensorflow": "TensorFlow is core to AI/ML. Add models or projects using it.",
  "scikit-learn": "Scikit-learn shows practical ML skills. Mention models or analysis work.",
  "keras": "Keras helps in fast model building. Highlight neural network projects with it.",
  "nlp": "NLP is a key AI field. Mention chatbots, text analysis, or sentiment analysis projects.",
  "linux": "Linux knowledge is crucial for DevOps. Mention scripting or system automation tasks.",
  "docker": "Docker is essential for containerization. Highlight how you containerized projects.",
  "kubernetes": "Kubernetes shows orchestration skills. Mention deployments or scaling experience.",
  "aws": "AWS is widely used in industry. Add projects using cloud deployment or hosting.",
  "ci/cd": "CI/CD pipelines show automation experience. Mention your workflow automation projects.",
  "automation": "Automation improves efficiency. Highlight scripts or systems you’ve automated."
}